Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00100.PIC
      <edc:SFRDef edc:_addr="0x40002834" edc:access="---------------n--------nnnnnnnn" edc:cname="DPRESCALER" edc:impl="0x100FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PRESCALER0" edc:desc="Debouncer Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES0" edc:desc="Debouncer number of states" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER1" edc:desc="Debouncer Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="EIC clock divided by 2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="EIC clock divided by 4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="EIC clock divided by 8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="EIC clock divided by 16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="EIC clock divided by 32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="EIC clock divided by 64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="EIC clock divided by 128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="EIC clock divided by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATES1" edc:desc="Debouncer number of states" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LFREQ3" edc:desc="3 low frequency samples" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LFREQ7" edc:desc="7 low frequency samples" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TICKON" edc:desc="Pin Sampler frequency selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK_EIC" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_LFREQ" edc:desc="Clocked by Low Frequency Clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002838" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PINSTATE" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PINSTATE0" edc:desc="Pin State of EXTINT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE1" edc:desc="Pin State of EXTINT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE2" edc:desc="Pin State of EXTINT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE3" edc:desc="Pin State of EXTINT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE4" edc:desc="Pin State of EXTINT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE5" edc:desc="Pin State of EXTINT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE6" edc:desc="Pin State of EXTINT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE7" edc:desc="Pin State of EXTINT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE8" edc:desc="Pin State of EXTINT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE9" edc:desc="Pin State of EXTINT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE10" edc:desc="Pin State of EXTINT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE11" edc:desc="Pin State of EXTINT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE12" edc:desc="Pin State of EXTINT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE13" edc:desc="Pin State of EXTINT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE14" edc:desc="Pin State of EXTINT14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE15" edc:desc="Pin State of EXTINT15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000283C" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="NSCHK" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="Non-Maskable External Interrupt Nonsecure Check Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002840" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="NONSEC" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="Non-Maskable Interrupt Nonsecure Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002844" edc:offset="0x1BC"/>
      <edc:SFRDef edc:_addr="0x40002A00" edc:access="---n--nn" edc:cname="CTRLA" edc:impl="0x13" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CKSEL" edc:desc="Clock Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CLK_GCLK" edc:desc="Clocked by GCLK" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_ULP32K" edc:desc="Clocked by ULP32K" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A01" edc:access="---nnnnn" edc:cname="NMICTRL" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMISENSE" edc:desc="Non-Maskable Interrupt Sense Configuration" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising-edge detection" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling-edge detection" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both-edges detection" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High-level detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low-level detection" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NMIFILTEN" edc:desc="Non-Maskable Interrupt Filter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NMIASYNCH" edc:desc="Asynchronous Edge Detection Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
