Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00100.PIC
      <edc:SFRDef edc:_addr="0x40002A02" edc:access="-------n" edc:cname="NMIFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="Non-Maskable Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002A03" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40002A04" edc:access="------------------------------rr" edc:cname="SYNCBUSY" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Synchronization Busy Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A08" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EVCTRL" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINTEO0" edc:desc="External Interrupt 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO1" edc:desc="External Interrupt 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO2" edc:desc="External Interrupt 2 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO3" edc:desc="External Interrupt 3 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO4" edc:desc="External Interrupt 4 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO5" edc:desc="External Interrupt 5 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO6" edc:desc="External Interrupt 6 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO7" edc:desc="External Interrupt 7 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO8" edc:desc="External Interrupt 8 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO9" edc:desc="External Interrupt 9 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO10" edc:desc="External Interrupt 10 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO11" edc:desc="External Interrupt 11 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO12" edc:desc="External Interrupt 12 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO13" edc:desc="External Interrupt 13 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO14" edc:desc="External Interrupt 14 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO15" edc:desc="External Interrupt 15 Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A0C" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="INTENCLR" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A10" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="INTENSET" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A14" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="INTFLAG" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-secure Check Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
