Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00100.PIC
      <edc:SFRDef edc:_addr="0x40003345" edc:access="-n---nnn" edc:cname="GROUP2PINCFG5" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003346" edc:access="-n---nnn" edc:cname="GROUP2PINCFG6" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003347" edc:access="-n---nnn" edc:cname="GROUP2PINCFG7" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003348" edc:access="-n---nnn" edc:cname="GROUP2PINCFG8" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003349" edc:access="-n---nnn" edc:cname="GROUP2PINCFG9" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000334A" edc:access="-n---nnn" edc:cname="GROUP2PINCFG10" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000334B" edc:access="-n---nnn" edc:cname="GROUP2PINCFG11" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000334C" edc:access="-n---nnn" edc:cname="GROUP2PINCFG12" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000334D" edc:access="-n---nnn" edc:cname="GROUP2PINCFG13" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000334E" edc:access="-n---nnn" edc:cname="GROUP2PINCFG14" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
