Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00100.PIC
      <edc:SFRDef edc:_addr="0x4200014D" edc:access="----nnnn" edc:cname="USER45" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200014E" edc:access="----nnnn" edc:cname="USER46" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200014F" edc:access="----nnnn" edc:cname="USER47" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000150" edc:access="----nnnn" edc:cname="USER48" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000151" edc:access="----nnnn" edc:cname="USER49" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000152" edc:access="----nnnn" edc:cname="USER50" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000153" edc:access="----nnnn" edc:cname="USER51" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000154" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x420001D4" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001D5" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001D6" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001D7" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x420001D8" edc:access="--------------------nnnnnnnnnnnn" edc:cname="NONSECCHAN" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Non-Secure for Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Non-Secure for Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Non-Secure for Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Non-Secure for Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Non-Secure for Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Non-Secure for Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Non-Secure for Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Non-Secure for Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:desc="Non-Secure for Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:desc="Non-Secure for Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:desc="Non-Secure for Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:desc="Non-Secure for Channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001DC" edc:access="--------------------nnnnnnnnnnnn" edc:cname="NSCHKCHAN" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Channel 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Channel 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Channel 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Channel 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Channel 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Channel 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Channel 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Channel 7 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:desc="Channel 8 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:desc="Channel 9 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:desc="Channel 10 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:desc="Channel 11 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NONSECUSER0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="Non-Secure for User 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="Non-Secure for User 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="Non-Secure for User 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="Non-Secure for User 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="Non-Secure for User 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="Non-Secure for User 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="Non-Secure for User 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="Non-Secure for User 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="Non-Secure for User 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="Non-Secure for User 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="Non-Secure for User 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="Non-Secure for User 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="Non-Secure for User 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="Non-Secure for User 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="Non-Secure for User 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="Non-Secure for User 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="Non-Secure for User 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="Non-Secure for User 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="Non-Secure for User 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="Non-Secure for User 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="Non-Secure for User 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="Non-Secure for User 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="Non-Secure for User 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER23" edc:desc="Non-Secure for User 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER24" edc:desc="Non-Secure for User 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER25" edc:desc="Non-Secure for User 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER26" edc:desc="Non-Secure for User 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER27" edc:desc="Non-Secure for User 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER28" edc:desc="Non-Secure for User 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER29" edc:desc="Non-Secure for User 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER30" edc:desc="Non-Secure for User 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER31" edc:desc="Non-Secure for User 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001E4" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="NONSECUSER1" edc:impl="0xFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER32" edc:desc="Non-Secure for User 32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER33" edc:desc="Non-Secure for User 33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER34" edc:desc="Non-Secure for User 34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER35" edc:desc="Non-Secure for User 35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER36" edc:desc="Non-Secure for User 36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER37" edc:desc="Non-Secure for User 37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER38" edc:desc="Non-Secure for User 38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER39" edc:desc="Non-Secure for User 39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER40" edc:desc="Non-Secure for User 40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER41" edc:desc="Non-Secure for User 41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER42" edc:desc="Non-Secure for User 42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER43" edc:desc="Non-Secure for User 43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER44" edc:desc="Non-Secure for User 44" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER45" edc:desc="Non-Secure for User 45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER46" edc:desc="Non-Secure for User 46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER47" edc:desc="Non-Secure for User 47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER48" edc:desc="Non-Secure for User 48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER49" edc:desc="Non-Secure for User 49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER50" edc:desc="Non-Secure for User 50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER51" edc:desc="Non-Secure for User 51" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x420001F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NSCHKUSER0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="User 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="User 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="User 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="User 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="User 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="User 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="User 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="User 7 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="User 8 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="User 9 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="User 10 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="User 11 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="User 12 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="User 13 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="User 14 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="User 15 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="User 16 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="User 17 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="User 18 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="User 19 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="User 20 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="User 21 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="User 22 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER23" edc:desc="User 23 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER24" edc:desc="User 24 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER25" edc:desc="User 25 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER26" edc:desc="User 26 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER27" edc:desc="User 27 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER28" edc:desc="User 28 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER29" edc:desc="User 29 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER30" edc:desc="User 30 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER31" edc:desc="User 31 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001F4" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="NSCHKUSER1" edc:impl="0xFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER32" edc:desc="User 32 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER33" edc:desc="User 33 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER34" edc:desc="User 34 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER35" edc:desc="User 35 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER36" edc:desc="User 36 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER37" edc:desc="User 37 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER38" edc:desc="User 38 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER39" edc:desc="User 39 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER40" edc:desc="User 40 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER41" edc:desc="User 41 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER42" edc:desc="User 42 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER43" edc:desc="User 43 to be checked as non-secured " edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER44" edc:desc="User 44 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER45" edc:desc="User 45 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER46" edc:desc="User 46 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER47" edc:desc="User 47 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER48" edc:desc="User 48 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER49" edc:desc="User 49 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER50" edc:desc="User 50 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER51" edc:desc="User 51 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001F8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x42000200" edc:access="-------w" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
