Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00100.PIC
      <edc:SFRDef edc:_addr="0xE002E41C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR7" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E420" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR8" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E424" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR9" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E428" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR10" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E42C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR11" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E430" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR12" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E434" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR13" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E438" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR14" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E43C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR15" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E440" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR16" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
