Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/edc/PIC32CM1216LS00100.PIC
      <edc:SFRDef edc:access="------nnnnnnnn-n" edc:addr="0x4100A018" edc:cname="INTENSET" edc:impl="0x3FD" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:desc="Suspend Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:desc="Start Of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:desc="End of Reset Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Wake Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:desc="End Of Resume Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:desc="Upstream Resume Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:desc="Ram Access Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPMNYET" edc:desc="Link Power Management Not Yet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPMSUSP" edc:desc="Link Power Management Suspend Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nnnnnnnn-n" edc:addr="0x4100A01C" edc:cname="INTFLAG" edc:impl="0x3FD" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:desc="Suspend" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:desc="Start Of Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:desc="End of Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Wake Up" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:desc="End Of Resume" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:desc="Upstream Resume" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:desc="Ram Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPMNYET" edc:desc="Link Power Management Not Yet" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPMSUSP" edc:desc="Link Power Management Suspend" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------rrrrrrrr" edc:addr="0x4100A020" edc:cname="EPINTSMRY" edc:impl="0xFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPINT0" edc:desc="End Point 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT1" edc:desc="End Point 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT2" edc:desc="End Point 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT3" edc:desc="End Point 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT4" edc:desc="End Point 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT5" edc:desc="End Point 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT6" edc:desc="End Point 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPINT7" edc:desc="End Point 7 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnn-nnn" edc:addr="0x4100A120" edc:cname="EPCFG1" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:desc="End Point Type0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:desc="End Point Type1" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnn-nnn" edc:addr="0x4100A1A0" edc:cname="EPCFG5" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:desc="End Point Type0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:desc="End Point Type1" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x4100A124" edc:cname="EPSTATUSCLR1" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x4100A1A4" edc:cname="EPSTATUSCLR5" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x4100A125" edc:cname="EPSTATUSSET1" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
